[
    {
        "id": 1,
        "dia": "Día 1",
        "detalle": [
            "Creación del proyecto con React-Vite con el nombre de: \ndesarrolloWebFrontEndTP2",
            "Se creo el repositorio en el link: \nhttps://github.com/fergeo/desarrolloWebFrontEndTP2",
            "Para el home se agregaron animaciones tambien.",
            "Cuamdp se cargam las tarjetas em las secciones: La Bombonera, Arqueros, Defensores, Mediocampistas y Deleanteros. Se agrego la animación de zoom-in de aos. Para la sección Weather se agrego una animación utilizando Framer Motion. Tambien se agrego animación a la sección Bitarora. ○ Efectos hover en elementos interactivos (tarjetas, botones).",
            "Existe uno que hacer hover sobre los botones de las tarjetas o sea el boton ver detalle tiene un cambio de color con el hover.",
            "Se creo el componente CerrarDetalle que tiene tambien un hover con fill. ○ Herramientas: CSS puro o Animate.css.",
            "Se agrego un filtro en la secciones Arqueros, Defensores, Mediocampistas y Delanteros. Se filtra por nombre y Apellido o por la fecha en que jugo.",
            "Se agrego un filtro a la bitacora que filtra por dia o por detalle.",
            "e realizo la paginación. La API solo permitio y se armo para que se muestre en 3 paginas que de casualidad coincide con el ejemplo dado."
        ]
    },
    {
        "id": 2,
        "dia": "Día 2",
        "detalle": [
            "El lightbox se aplico en las secciones La Bombonera, Arqueros, Defensores, Delanteros y Mediocampostas.",
            "Para cada jugador se agrego las habilidades: stamina, velocidad y presición.",
            "Se aprovecho para agregar iconos de las copas ganadas por ese jugador.",
            "Se agrego los iconos de redes socilaes de Github, Likedin e Instagram. Y tiene un efecto de hober que tiene un zook de un 30%.  \nGithub: https://github.com/fergeo  \nLinkedin: https://www.linkedin.com/in/fernandoespindolaomastott/ \nInstagram: https://www.instagram.com/fernando_espindola_o/"

        ]
    },
    {
        "id": 3,
        "dia": "Día 3",
        "detalle": [
            "Se agrego un carrousel que tiene imagenes de la bombonera y de todos los jugadores, que si se le da click a uno del aca del carrousel lleva a la seccion correspondiente.",
            "Se realizo una sección con los nombres de cada seeción que segun si se checkean o no se mostrara el boton o no segun corresponda en el Sidebar.",
            "Deploy en Vercel: \nLink: https://desarrollo-web-front-end-tp-2.vercel.app/"
        ]
    },
    {
        "id": 4,
        "dia": "Día 4",
        "detalle": [
            "Cirrección del detalle de La Bombonera para que no muesre ni habilidades ni copas ganadas.",
            "Armado de la Bitacora."
        ]
    }
]